package Practice17;

public class Practice17_answers {

    /*
    1. access modifers
  public - פונקציה או משתנה ניתנים לגישה בכול מחלקה
  private - פונקציות או משתנים ניתנים לגישה מפונקציות של אותה מחלקה בלבד
  protected - פונקציה או פונקציה ניתנים לגישה מפונקציוצ של אותה מחלקה  ומהירשות ממנה

  2.name package
  זה שם התקיה שמכילה קבוצת מחלקות הקשורות אחת לשניה.
  import - משמש לייבא את את ה תקיה שמכילה תכונות שאיתם אני רוצה להשתמש

  3.junit
  הוא כלי פיתוח וחופשי לבדיקות יחידה בשפת ג'אווה
  והוא מכיל ספריית פיצוח וכלי גרפי להצגת תוצאות ריצה
  sellenium זה תשתית אוטומציה לדפדפנים הגדולה בעולם כיום
  התשתית מגיעה על מנת לתת פתרון פשוט נוח וקל.

5.
 //5 הם נותנים לנו גישה משתנה מסויים לקחת מידע או לשנות מידע
 עם לומבוק אנחנו חוסכים כתיבה וזה מקצר את זמןהעבודה אבל החסרונות שלפעמים נראצה לשנות או לבנות בנאי ולשנוצ שם משהו עם הלומבוק אנחנו לא יכולים
8.
הן מורישות את התכונות שלהם בירושה
המילה משמשת לרהחרת במחלקה שתקבל את התכונות מהמחלה היורשת
9.
לא היא לא יכולה
10.
כן תהיה לא קשור לירושה בגלל שהוא פאבליק יש לכול המחלקות גישה

11.
 כו אפשר לייצר לו גטר אבל אי אפשר לעשות לו סטר בגלל הפיינל

 12.
 כדור הארץ יורש מכוכב לכת

 15.
 תצטרך לרשת מהאא הגדול כלי טיס כי שם הוא מכיל את הפטמטרים של כלי טיס כמו מטוס



     */



}
